adrianvancea16/mcxa153-touch-audio-workstation/software/source/ui_display.c
/* Continuous 4-stop gradient (green -> cyan -> violet -> pink) instead of the
 * old flat 3-tier VU-meter coloring. Takes the bin magnitude (0-255) rather
 * than a pixel height, so the colour tracks how loud the band actually is and
 * stays put if the bar geometry is ever retuned. */
uint16_t get_gradient_color(int level) {
    if (level < 0) level = 0;
    if (level > 255) level = 255;
    if (level <= 85)       return lerp565(SPEC_C0, SPEC_C1, (uint8_t)(level * 255 / 85));
    else if (level <= 170) return lerp565(SPEC_C1, SPEC_C2, (uint8_t)((level - 85) * 255 / 85));
    else                   return lerp565(SPEC_C2, SPEC_C3, (uint8_t)((level - 170) * 255 / 85));
}

static void draw_footer(const char *label1, uint16_t tint1, const char *label2, uint16_t tint2, const char *label3, uint16_t tint3) {
    draw_panel(5, 280, 70, 35, COLOR_PANEL, tint1);
    draw_string_scaled(15, 292, label1, COLOR_TEXT, 1);
    draw_panel(80, 280, 80, 35, COLOR_PANEL, tint2);
    draw_string_scaled(90, 292, label2, COLOR_TEXT, 1);
    draw_panel(165, 280, 70, 35, COLOR_PANEL, tint3);
    draw_string_scaled(175, 292, label3, COLOR_TEXT, 1);
}

#define APP_MODE_SYNTH 0
#define APP_MODE_SD    1
#define APP_MODE_WIFI  2

void ui_display_mode(uint8_t mode) {
    active_mode = mode;
    redraw_needed = true;
    if (mode != APP_MODE_SD) sdcard_stop_playback();
    if (mode == APP_MODE_SD) sdcard_recheck(); /* no CD pin -- (re)mounting IS the detection */
    if (mode != APP_MODE_SD || !sdcard_is_playing()) AudioEngine_SetMode(AUDIO_MODE_SYNTH);
}

/* ---------------- SYNTHESIZER ----------------
 *
 * Layout, top to bottom:  header card (5..49) / input level meter (56..79) /
 * spectrum well (86..265) / frequency axis (269) / footer (280..315).
 *
 * The spectrum sits in a black "well" with a baseline rail and edge ticks so
 * it reads as an instrument rather than bars floating on the background. The
 * axis labels and ticks live in the margins either side of the bars, which is
 * what makes them affordable: they are drawn once per screen redraw and are
 * never touched by the per-frame bar clearing. */
#define SPECTRUM_BARS 16 /* divides FFT_SIZE/2 (128) evenly -- every bin gets shown, none dropped */
#define SPECTRUM_BAR_PITCH 13
#define SPECTRUM_BAR_WIDTH 10

#define SPEC_X      5
#define SPEC_Y      86
#define SPEC_W      230
#define SPEC_H      180
#define SPEC_BASE   261 /* y of the bar baseline */
#define SPEC_MAX_H  160 /* tallest bar reaches y = SPEC_BASE - SPEC_MAX_H */
#define SPEC_BAR_X0 14  /* 16 bars at pitch 13 -> x 14..217 */

#define METER_X   14
#define METER_Y   68
#define METER_W   212
#define METER_H   11
#define METER_RED (METER_W * 82 / 100) /* start of the red zone on the track */
/* Reading that counts as full scale. GetLevel() is a smoothed absolute sample
 * (0-32767), but after the fixed 4x gain a normal speaking voice sits well
 * under 10k, so scaling against the full range would leave the meter barely
 * twitching. */
#define METER_FULL_SCALE 9000U

static uint8_t s_peak[SPECTRUM_BARS] = {0};
static uint32_t s_blink_counter = 0;

/* Repaint a horizontal slice of the level-meter track, honouring the red zone
 * so an erase never wipes it out. */
static void meter_track(int from, int to) {
    if (to <= from) return;
    if (to <= METER_RED) {
        draw_rect(METER_X + from, METER_Y, to - from, METER_H, COLOR_WELL);
    } else if (from >= METER_RED) {
        draw_rect(METER_X + from, METER_Y, to - from, METER_H, COLOR_REDZONE);
    } else {
        draw_rect(METER_X + from, METER_Y, METER_RED - from, METER_H, COLOR_WELL);
        draw_rect(METER_X + METER_RED, METER_Y, to - METER_RED, METER_H, COLOR_REDZONE);
    }
}

static int s_meter_w = 0;
static uint16_t s_meter_fill = 0;

static void draw_level_meter(void) {
    uint32_t w = ((uint32_t)AudioEngine_GetLevel() * METER_W) / METER_FULL_SCALE;
    if (w > METER_W) w = METER_W;

    uint16_t fill = (w > (uint32_t)METER_RED) ? COLOR_WARN : COLOR_ACCENT;
    if (fill != s_meter_fill) {
        /* Tier changed, so the whole filled part needs the new colour. */
        if (w > 0) draw_rect(METER_X, METER_Y, (int)w, METER_H, fill);
        meter_track((int)w, METER_W);
        s_meter_fill = fill;
    } else if ((int)w > s_meter_w) {
        draw_rect(METER_X + s_meter_w, METER_Y, (int)w - s_meter_w, METER_H, fill);
    } else if ((int)w < s_meter_w) {
        meter_track((int)w, s_meter_w);
    }
    s_meter_w = (int)w;
}

static void draw_synth_screen(void) {
    if (redraw_needed) {
        lcd_fill_screen(COLOR_BG);

        draw_card(5, 5, 230, 44, COLOR_HEADER, COLOR_ACCENT);
        draw_string_scaled(14, 13, "SYNTHESIZER", COLOR_TEXT, 2);
        char buf[24];
        snprintf(buf, sizeof(buf), "filter: %s", AudioEngine_GetVoiceFilterName(AudioEngine_GetVoiceFilter()));
        draw_string_scaled(14, 34, buf, COLOR_ACCENT2, 1);

        /* Input level meter */
        draw_string_scaled(14, 56, "input", COLOR_MUTED, 1);
        s_meter_w = METER_W; s_meter_fill = COLOR_ACCENT; /* force a full repaint below */
        meter_track(0, METER_W);
        s_meter_w = 0;

        /* Spectrum well */
        draw_rect(SPEC_X, SPEC_Y, SPEC_W, SPEC_H, COLOR_BORDER);
        draw_rect(SPEC_X + 2, SPEC_Y + 2, SPEC_W - 4, SPEC_H - 4, COLOR_WELL);
        draw_rect(SPEC_X + 2, SPEC_BASE + 1, SPEC_W - 4, 2, COLOR_BORDER); /* baseline rail */

        /* Amplitude ticks, in the margins either side of the bars so the
         * per-frame bar clearing never has to repaint them. */
        for (int q = 1; q <= 3; q++) {
            int y = SPEC_BASE - (SPEC_MAX_H * q) / 4;
            draw_rect(SPEC_X + 3, y, 5, 1, COLOR_BORDER);
            draw_rect(SPEC_X + SPEC_W - 8, y, 5, 1, COLOR_BORDER);
        }

        /* Frequency axis: 16kHz sampling, so the 16 bars span DC to 8kHz. */
        draw_string_scaled(SPEC_BAR_X0, 269, "0", COLOR_MUTED, 1);
        draw_string_scaled(SPEC_BAR_X0 + 4 * SPECTRUM_BAR_PITCH, 269, "2k", COLOR_MUTED, 1);
        draw_string_scaled(SPEC_BAR_X0 + 8 * SPECTRUM_BAR_PITCH, 269, "4k", COLOR_MUTED, 1);
        draw_string_scaled(SPEC_BAR_X0 + 12 * SPECTRUM_BAR_PITCH, 269, "6k", COLOR_MUTED, 1);
        draw_string_scaled(SPEC_BAR_X0 + 15 * SPECTRUM_BAR_PITCH + 2, 269, "8k", COLOR_MUTED, 1);

        draw_footer("MODE", COLOR_BORDER, "FILTER", COLOR_ACCENT2, freeze ? "RESUME" : "FREEZE", freeze ? COLOR_WARN : COLOR_OK);
        for (int i = 0; i < SPECTRUM_BARS; i++) s_peak[i] = 0;
        redraw_needed = false;
    }

    /* Small pulsing dot next to the header confirms the mic->headphone
     * monitoring path is live (see AudioEngine_Process, AUDIO_MODE_SYNTH).
     * BUG FIXED HERE: this used to call draw_rect() -- a full bit-banged SPI
     * transaction -- on every single call to draw_synth_screen(), i.e. every
     * main-loop iteration, thousands of times a second, completely
     * independent of the ~16ms FFT/bar-redraw cadence. That's almost
     * certainly a bigger, more *constant* source of SPI switching noise than
     * the bars ever were. Now it only actually draws when the color changes
     * (twice per blink cycle), like everything else on this screen. */
    s_blink_counter++;
    uint16_t dot_color = (s_blink_counter & 0x10000U) ? COLOR_OK : COLOR_PANEL;
    static uint16_t s_last_dot_color = 0xFFFF;
    if (dot_color != s_last_dot_color) {
        draw_rect(210, 16, 10, 10, dot_color);
        s_last_dot_color = dot_color;
    }

    /* Everything below repaints on the FFT cadence (~16ms), never per
     * main-loop iteration -- see the note on the blinking dot above. */
    if (AudioEngine_FFTReady) {
        draw_level_meter(); /* stays live even when the spectrum is frozen */

        if (!freeze) {
            const int bins_per_bar = (FFT_SIZE / 2) / SPECTRUM_BARS;
            for (int i = 0; i < SPECTRUM_BARS; i++) {
                uint32_t sum = 0;
                for (int b = 0; b < bins_per_bar; b++) sum += AudioEngine_FFTBins[i * bins_per_bar + b];
                int level = (int)(sum / bins_per_bar);      /* 0-255 magnitude */
                int h = (level * SPEC_MAX_H) / 255;         /* -> pixels */

                if (h > (int)s_peak[i]) s_peak[i] = (uint8_t)h;

