adrianvancea16/mcxa153-touch-audio-workstation/software/source/ui_display.c
                int x = SPEC_BAR_X0 + i * SPECTRUM_BAR_PITCH;
                draw_rect(x, SPEC_BASE - SPEC_MAX_H, SPECTRUM_BAR_WIDTH, SPEC_MAX_H - h, COLOR_WELL);
                if (h > 0) draw_rect(x, SPEC_BASE - h, SPECTRUM_BAR_WIDTH, h, get_gradient_color(level));
                draw_rect(x, SPEC_BASE - s_peak[i] - 2, SPECTRUM_BAR_WIDTH, 2, COLOR_TEXT);

                if (s_peak[i] > 0) s_peak[i]--; /* slow decay */
            }
        }
        AudioEngine_FFTReady = false;
    }
}

static void synth_action1(void) { /* SW2: cycle voice filter */
    VoiceFilter_t f = (VoiceFilter_t)((AudioEngine_GetVoiceFilter() + 1) % VOICE_FILTER_COUNT);
    AudioEngine_SetVoiceFilter(f);
    redraw_needed = true;
}
static void synth_action2(void) { /* SW3: freeze/unfreeze the spectrum */
    freeze = !freeze;
    redraw_needed = true;
}

/* ---------------- SD RECORDER ---------------- */
static void draw_sd_screen(void) {
    static uint32_t last_elapsed = 0xFFFFFFFF;
    static bool last_rec = false, last_play = false, last_present = true;
    bool present = sdcard_is_inserted();

    if (redraw_needed) {
        lcd_fill_screen(COLOR_BG);
        draw_card(5, 5, 230, 44, COLOR_HEADER, COLOR_ACCENT);
#if DEMO_MODE
        /* Says so on screen, so a photo of this build is never mistaken for a
         * working card. See demo_mode.h. */
        draw_string_scaled(14, 12, "SD RECORDER", COLOR_TEXT, 2);
        draw_string_scaled(14, 33, "demo - simulated card", COLOR_DEMO, 1);
#else
        draw_string_scaled(15, 20, "SD RECORDER", COLOR_TEXT, 2);
#endif

        draw_card(5, 55, 230, 65, COLOR_PANEL, present ? COLOR_OK : COLOR_WARN);
        draw_string_scaled(15, 65, "sd card status", COLOR_MUTED, 1);
        if (present) {
            draw_string_scaled(15, 85, "DETECTED", COLOR_OK, 1);
            char buf[24];
            snprintf(buf, sizeof(buf), "free: %lu kb", (unsigned long)sdcard_free_space_kb());
            draw_string_scaled(15, 103, buf, COLOR_TEXT, 1);
        } else {
            draw_string_scaled(15, 85, "NOT DETECTED", COLOR_WARN, 1);
            draw_string_scaled(15, 103, "recording disabled", COLOR_MUTED, 1);
        }

        draw_footer("MODE", COLOR_BORDER, "REC", COLOR_WARN, "PLAY", COLOR_OK);

        last_elapsed = 0xFFFFFFFF; last_rec = !sdcard_is_recording(); last_play = !sdcard_is_playing(); last_present = !present;
        redraw_needed = false;
    }

    uint32_t elapsed = sdcard_record_elapsed_ms() / 100;
    bool rec = sdcard_is_recording(), play = sdcard_is_playing();
    if (present != last_present || elapsed != last_elapsed || rec != last_rec || play != last_play) {
        last_present = present; last_elapsed = elapsed; last_rec = rec; last_play = play;

        uint16_t stateColor = rec ? COLOR_WARN : play ? COLOR_OK : COLOR_ACCENT2;
        draw_card(5, 135, 230, 100, COLOR_PANEL, present ? stateColor : COLOR_BORDER);
        if (!present) {
            draw_string_scaled(35, 175, "insert sd card", COLOR_WARN, 1);
        } else if (rec) {
            draw_string_scaled(50, 150, "RECORDING", COLOR_WARN, 2);
            char buf[24];
            snprintf(buf, sizeof(buf), "time: %lu.%lus", (unsigned long)(elapsed / 10), (unsigned long)(elapsed % 10));
            draw_string_scaled(45, 190, buf, COLOR_TEXT, 1);
        } else if (play) {
            draw_string_scaled(55, 150, "PLAYING", COLOR_OK, 2);
            char buf[28];
            snprintf(buf, sizeof(buf), "%s", sdcard_current_filename());
            draw_string_scaled(20, 190, buf, COLOR_MUTED, 1);
        } else {
            draw_string_scaled(70, 150, "READY", COLOR_ACCENT, 2);
            char buf[28];
            snprintf(buf, sizeof(buf), "file: %s", sdcard_current_filename());
            draw_string_scaled(15, 190, buf, COLOR_TEXT, 1);
            snprintf(buf, sizeof(buf), "(%u / %u)", sdcard_file_selected_number(), sdcard_file_count());
            draw_string_scaled(15, 208, buf, COLOR_MUTED, 1);
        }
    }
}

static void sd_action1(void) { /* SW2: REC start/stop, blocked entirely without a real card */
    if (!sdcard_is_inserted()) return;
    if (sdcard_is_recording()) sdcard_stop_recording();
    else sdcard_start_recording();
    redraw_needed = true;
}
static void sd_action2(void) { /* SW3: play current file, or stop+advance to the next one */
    if (!sdcard_is_inserted() || sdcard_is_recording()) return;
    if (sdcard_is_playing()) { sdcard_stop_playback(); sdcard_next_file(); }
    else sdcard_start_playback();
    redraw_needed = true;
}

/* ---------------- WIFI SERVER ---------------- */
static bool wifi_show_level = false;

static void draw_wifi_screen(void) {
    static uint32_t last_reqs = 0xFFFFFFFF;
    static wifi_state_t last_state = (wifi_state_t)0xFF;

    if (redraw_needed) {
        lcd_fill_screen(COLOR_BG);
        draw_card(5, 5, 230, 44, COLOR_HEADER, COLOR_ACCENT2);
#if DEMO_MODE
        draw_string_scaled(14, 12, "WIFI SERVER", COLOR_TEXT, 2);
        draw_string_scaled(14, 33, "demo - simulated link", COLOR_DEMO, 1);
#else
        draw_string_scaled(15, 20, "WIFI SERVER", COLOR_TEXT, 2);
#endif

        draw_card(5, 55, 230, 100, COLOR_PANEL, COLOR_ACCENT2);
        char buf[28];
        snprintf(buf, sizeof(buf), "ssid: %s", wifi_esp_get_ssid());
        draw_string_scaled(15, 65, buf, COLOR_TEXT, 1);
        snprintf(buf, sizeof(buf), "ip: %s", wifi_esp_get_ip());
        draw_string_scaled(15, 83, buf, COLOR_TEXT, 1);

        draw_footer("MODE", COLOR_BORDER, "RESTART", COLOR_ACCENT2, wifi_show_level ? "INFO" : "LEVEL", COLOR_OK);
        last_reqs = 0xFFFFFFFF; last_state = (wifi_state_t)0xFF;
        redraw_needed = false;
    }

    wifi_state_t state = wifi_esp_get_state();
    uint32_t reqs = wifi_esp_get_request_count();
    if (state != last_state || reqs != last_reqs) {
        last_state = state; last_reqs = reqs;
        uint16_t stateColor = (state == WIFI_STATE_READY) ? COLOR_OK : (state == WIFI_STATE_ERROR) ? COLOR_WARN : COLOR_ACCENT;
        draw_rect(15, 103, 210, 12, COLOR_PANEL);
        char buf[28];
        snprintf(buf, sizeof(buf), "state: %s", wifi_esp_get_state_name());
        draw_string_scaled(15, 103, buf, stateColor, 1);
        draw_rect(15, 121, 210, 12, COLOR_PANEL);
        snprintf(buf, sizeof(buf), "requests: %lu", (unsigned long)reqs);
        draw_string_scaled(15, 121, buf, COLOR_MUTED, 1);
    }

    if (wifi_show_level) {
        draw_card(5, 165, 230, 60, COLOR_PANEL, COLOR_OK);
        draw_string_scaled(15, 175, "live input level", COLOR_MUTED, 1);
        uint16_t level = AudioEngine_GetLevel();
        uint32_t w = (level * 200U) / 32767U;
        if (w > 200) w = 200;
        draw_rect(20, 200, w, 12, COLOR_OK);
        draw_rect(20 + w, 200, 200 - w, 12, COLOR_BG);
    }
}

static void wifi_action1(void) { wifi_esp_restart(); redraw_needed = true; }
static void wifi_action2(void) { wifi_show_level = !wifi_show_level; redraw_needed = true; }

/* ---------------- Dispatch ---------------- */

void ui_display_process_loop(void) {
    if (active_mode == APP_MODE_SYNTH) draw_synth_screen();
    else if (active_mode == APP_MODE_SD) draw_sd_screen();
    else draw_wifi_screen();
}

void ui_handle_action1(uint8_t mode) {
    if (mode == APP_MODE_SYNTH) synth_action1();
    else if (mode == APP_MODE_SD) sd_action1();
    else wifi_action1();
}
void ui_handle_action2(uint8_t mode) {
    if (mode == APP_MODE_SYNTH) synth_action2();
    else if (mode == APP_MODE_SD) sd_action2();
    else wifi_action2();
}
